



{
  "events": [
    {
      "id": "jab-we-code",
      "title": "Jab We Code",
      "date": "28th March",
      "time": "10:00 AM",
      "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSc64c0Xo9KdG5CY8HTQX4MxQlkw6Ci92v6N8TKZro3HJt8iug/viewform?usp=sharing",
      "description": "A unique coding contest where teams of two switch contests midway and strategize together in the final phase. The final score is based on combined contest performance.",
      "longDescription": "Jab We Code is a unique programming contest that tests teamwork, adaptability, and strategic decision-making. Teams of two begin by solving separate contests (Contest A and Contest B) for 30 minutes before discussing their progress and swapping challenges. After another 30 minutes, they strategize once more before entering the final 20-minute phase, where both contests are open, and members decide who tackles which problem. The final ranking is determined by the combined scores of both contests. The top three teams win cash prizes.",
      "category": "CSE Events",
      "contact": ["Dhrumi Panchal (9313464215)", "Jugal Vaghmashi (7405222505)"],
      "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/Jab_We_Code_sau6mm.png",
      "rules": [
        "Rule 1: Teams consist of two members",
        "Rule 2: Each member starts solving a separate coding contest",
        "Rule 3: After 30 minutes, a 5-minute discussion is allowed before switching contests",
        "Rule 4: After another 30 minutes, teams get a final 5-minute discussion",
        "Rule 5: The last 20 minutes allow both members to work on separate contests simultaneously",
        "Rule 6: The team’s total score determines the winners"
      ],
      "howToApply": [
        "Finalise team members",
        "Fill the registration form",
        "Enjoy the event"
      ],
      "relatedEvents": [
        {
          "id": "optimized-minds",
          "title": "Optimized Minds - Machine Learning",
          "category": "CSE Events",
          "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/Optimized_Mind_wl0omk.png"
        },
        {
          "id": "hera-pheri",
          "title": "Hera Pheri 3.0",
          "category": "CSE Events",
          "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/Hera_Pheri_xzghqe.png"
        }
      ]
    },
    {
      "id": "optimized-minds",
      "title": "Optimized Minds - Machine Learning",
      "date": "29th March",
      "time": "1:00 PM",
      "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLScJ4tjwSKSUuyPgvDUi3PC6SA3rqWcQkPpTClCbH24yW57qHQ/viewform?usp=sharing",
      "description": "Teams choose one of three problem statements and develop an optimized machine learning solution using provided datasets. Solutions are judged on accuracy, efficiency, and innovation.",
      "longDescription": "Participants will work on one of three given problem statements, using relevant datasets to build the most optimized machine learning model. Teams will be judged based on the efficiency of their models, accuracy of predictions, and innovation in approach. The competition lasts three hours, during which teams analyze data, develop models, and present their findings. Judges will assess optimization and performance metrics to determine winners. The best-performing team for each problem statement wins ₹2000.",
      "category": "CSE-Events",
      "contact": ["Dhrumi Panchal (9313464215)", "Jugal Vaghmashi (7405222505)"],
      "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/Optimized_Mind_wl0omk.png",
      "rules": [
        "Rule 1: Teams of 1 to 3 members",
        "Rule 2: Each team selects one problem statement from the given options",
        "Rule 3: Relevant datasets will be provided for analysis",
        "Rule 4: Solutions must prioritize accuracy, efficiency, and innovation",
        "Rule 5: Judges will evaluate based on model performance and optimization",
        "Rule 6: One winning team per problem statement (₹2000 prize per winning team)"
      ],
      "howToApply": [
        "Finalise team members",
        "Fill the registration form",
        "Enjoy the event"
      ],
      "relatedEvents": [
        {
          "id": "jab-we-code",
          "title": "Jab We Code",
          "category": "CSE Events",
          "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/Jab_We_Code_sau6mm.png"
        },
        {
          "id": "hackathon",
          "title": "Ingenious Hackathon 6.0",
          "category": "Hackathon",
          "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741713922/Hackathon_1_a3i5ku.jpg"
        }
      ]
    },
    {
      "id": "hera-pheri",
      "title": "Hera Pheri 3.0",
      "date": "30th March",
      "time": "1:00 PM",
      "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSdP4yFhi_4SeqGJPux_LvIS2drVadYPwneBjZLQmF1vfP15xQ/viewform?usp=sharing",
      "description": "A three-round event combining a treasure hunt, logical reasoning quiz, and a final \"Potli\" hunt to determine winners. Tests problem-solving, strategy, and teamwork.",
      "longDescription": "This event consists of three rounds. The first is a treasure hunt, where teams solve clues to reach different campus locations. The top 10 teams move to a quiz round, where logical questions determine the final four teams. The last round is a \"Potli\" hunt, where teams search for hidden potlis containing different rewards. The team that finds the golden potli wins ₹5000, with runner-up receiving ₹3000. This event emphasizes problem-solving, teamwork, and quick thinking.",
      "category": "CSE Events",
      "contact": ["Dhrumi Panchal (9313464215)", "Jugal Vaghmashi (7405222505)"],
      "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/Hera_Pheri_xzghqe.png",
      "rules": [
        "Rule 1: Teams must complete the treasure hunt to qualify for the quiz round",
        "Rule 2: Top 10 teams from the treasure hunt advance to the quiz round",
        "Rule 3: Logical questions will be conducted on Discord, affecting team progression",
        "Rule 4: The final four teams search for hidden potlis containing different prizes",
        "Rule 5: The golden potli determines the winning team",
        "Rule 6: Prize pool: ₹5000 (winner), ₹3000 (runner-up)"
      ],
      "howToApply": [
        "Finalise team members",
        "Fill the registration form",
        "Enjoy the event"
      ],
      "relatedEvents": [
        {
          "id": "jab-we-code",
          "title": "Jab We Code",
          "category": "CSE Events",
          "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/Jab_We_Code_sau6mm.png"
        },
        {
          "id": "optimized-minds",
          "title": "Optimized Minds - Machine Learning",
          "category": "CSE Events",
          "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/Optimized_Mind_wl0omk.png"
        }
      ]
    },
    {
      "id": "hackathon",
      "title": "Ingenious Hackathon 6.0",
      "date": "22th March",
      "time": "9:00 AM",
      "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSeMOdR_P24l_1uf30CmNjeOaobG_fVfS88PACIHxpKDZtlPPA/viewform?usp=sharing",
      "description": "The Ingenious Hackathon, a highlight of the annual Ingenium tech fest, is a hub of innovation and coding excellence. Aspiring programmers tackle real-world challenges under time constraints, testing their problem-solving skills, teamwork, and adaptability.",
      "longDescription": "Welcome to Ingenious Hackathon 6.0, a dynamic 36-hour innovation sprint where creativity meets technology! Whether you're a beginner taking your first steps into coding or a seasoned developer pushing the boundaries of what's possible, this is your space to build, learn, and collaborate. At Ingenious Hackathon 6.0, we believe in the power of ideas. Over the course of the event, you'll form teams, brainstorm solutions, and develop impactful projects around cutting-edge themes like AI/ML, Web3, FinTech, Sustainability, IoT, Open Innovation, and much more. We’re bringing together developers, designers, product thinkers, and creators to solve real-world challenges, build something meaningful, and connect with an inspiring tech community. Why Join? ✨ Turn your ideas into working prototypes. 🤝 Network with industry experts, mentors, and fellow innovators. 🏆 Win exciting prizes and showcase your work to top judges. 📚 Learn new skills through workshops and mentorship. 🚀 Build something that could make a difference. No matter your background or experience level, this hackathon is for YOU. So grab your laptop, fuel your creativity, and get ready to build the future.",
      "category": "Hackathon",
      "contact": ["ieee.sb@ahduni.edu.in"],
      "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741713922/Hackathon_1_a3i5ku.jpg",
      "rules": [
        "Rule 1: Only upon the arrival of the entire team can the team start solving the next puzzle",
        "Rule 2: Contact with other teams or people not a part of the event, which in any form may compromise the integrity of the puzzles, is not allowed",
        "Rule 3: The team is allowed to click photos of any resource they may consider useful during the duration of the event",
        "Rule 4: A volunteer will be present with each team to ensure the above rules are followed"
      ],
      "howToApply": [
        "Finalise team members",
        "Fill the registration form",
        "Enjoy the event"
      ],
      "relatedEvents": [
        {
          "id": "optimized-minds",
          "title": "Optimized Minds - Machine Learning",
          "category": "CSE Events",
          "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/Optimized_Mind_wl0omk.png"
        },
        {
          "id": "jab-we-code",
          "title": "Jab We Code",
          "category": "CSE Events",
          "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/Jab_We_Code_sau6mm.png"
        }
      ]
    },
    {
      "id": "shaft-tank",
      "title": "Shaft Tank",
      "date": "29th March",
      "time": "10:00 AM",
      "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLSeCGtjC2J3N_2ULrQ60oqjSdIXFs0NGOQ7K5doOCYSWBhA2mQ/viewform?usp=sharing",
      "description": "A competition to encourage students to showcase their creativity, innovation, and confidence by pitching their ideas in front of a panel of judges.",
      "longDescription": "Shaft Tank is designed to bring out the creativity and innovation of students by allowing them to pitch unique ideas or products. Teams of up to 3 members will present their ideas, which can be in the form of an abstract, CAD model, prototype, or a finished product. The event aims to foster confidence and provide a platform for students to showcase their skills. Judges will evaluate pitches based on idea originality, delivery, and potential investment appeal.",
      "category": "Mech Events",
      "contact": ["Manush Shah (7486098667)", "Dev Shah (9825219414)"],
      "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870019/Shaft_Tank_pdfblc.jpg",
      "rules": [
        "Rule 1: Team cannot exceed 3 members",
        "Rule 2: All soft copies related to the pitch must be submitted 48 hours before the event",
        "Rule 3: The idea/product must be something novel",
        "Rule 4: Any reference taken from any place must be mentioned. Plagiarism is strictly prohibited",
        "Rule 5: Pitch cannot exceed 7 minutes",
        "Rule 6: There will be a 10% deduction of investment if the pitch exceeds the time limit",
        "Rule 7: Teams must reach the venue at least 30 minutes before the event. Failing to do so will result in disqualification",
        "Rule 8: Decisions taken by the event heads and panel members will be final"
      ],
      "howToApply": [
        "Finalise team members",
        "Fill the registration form",
        "Enjoy the event"
      ],
      "relatedEvents": [
        {
          "id": "rc-car-race",
          "title": "RC Car Race",
          "category": "Mech Events",
          "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/RC_Car_Race_sh7chv.jpg"
        }
      ]
    },
    {
      "id": "rc-car-race",
      "title": "RC Car Race",
      "date": "30th March",
      "time": "10:00 AM",
      "registrationLink": "https://docs.google.com/forms/d/e/1FAIpQLScvaNSweK5qNHR78CM053jpJKfHmNLiqPCe7V2WfDfkKBY6wA/viewform?usp=sharing",
      "description": "An RC car racing event where teams build and race their own self-fabricated cars on a challenging track with obstacles, aiming for speed, precision, and innovation.",
      "longDescription": "RC Car Race challenges teams to design and build their own remote-controlled cars for a thrilling competition. Participants must fabricate their cars and navigate a track filled with obstacles like gravel, dirt, ramps, and sharp turns. With strict rules on construction and fair play, the event emphasizes creativity, technical skills, and racing strategy. Teams must fine-tune their vehicles and race against opponents in multiple rounds, culminating in an exciting final lap battle to determine the champion.",
      "category": "Mech Events",
      "contact": ["Manush Shah (7486098667)", "Dev Shah (9825219414)"],
      "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870020/RC_Car_Race_sh7chv.jpg",
      "rules": [
        "Rule 1: Teams must consist of 2-5 members from the same university/college",
        "Rule 2: Participants must be pursuing undergraduate majors",
        "Rule 3: Teams must report 45 minutes prior to the first round",
        "Rule 4: Teams must submit a video of the car working, along with microcontroller code and car specifications",
        "Rule 5: Only one driver is allowed to control the car at the event",
        "Rule 6: No team member (including the driver) is allowed inside the yellow line zone enclosing the track",
        "Rule 7: If a car goes off track, it will be disqualified from the round and event",
        "Rule 8: A 2-second penalty will be given for minor car collisions based on judge’s decision",
        "Rule 9: A 10-second penalty applies for deliberate bumps causing another car to go off course",
        "Rule 10: Partial off-track violations without collision incur a 2-second penalty"
      ],
      "howToApply": [
        "Finalise team members",
        "Fill the registration form",
        "Enjoy the event"
      ],
      "relatedEvents": [
        {
          "id": "shaft-tank",
          "title": "Shaft Tank",
          "category": "Mech Events",
          "image": "https://res.cloudinary.com/dub5rms8i/image/upload/v1741870019/Shaft_Tank_pdfblc.jpg"
        }
      ]
    }
  ]
}